; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-17)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	satellite8 - satellite
	instrument16 - instrument
	instrument17 - instrument
	satellite9 - satellite
	instrument18 - instrument
	instrument19 - instrument
	satellite10 - satellite
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	satellite11 - satellite
	instrument23 - instrument
	infrared3 - mode
	image0 - mode
	thermograph1 - mode
	image4 - mode
	infrared2 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument3 infrared3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared3)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star21)
	(supports instrument6 image0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared2)
	(supports instrument8 image4)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star21)
	(supports instrument9 infrared3)
	(calibration_target instrument9 Star1)
	(supports instrument10 image4)
	(supports instrument10 image0)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star22)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star1)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
	(supports instrument12 image4)
	(calibration_target instrument12 GroundStation0)
	(supports instrument13 image4)
	(calibration_target instrument13 Star1)
	(supports instrument14 thermograph1)
	(supports instrument14 infrared2)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon20)
	(supports instrument15 image0)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 GroundStation4)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet12)
	(supports instrument16 image0)
	(supports instrument16 infrared2)
	(calibration_target instrument16 Star1)
	(supports instrument17 infrared3)
	(calibration_target instrument17 GroundStation0)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Phenomenon23)
	(supports instrument18 thermograph1)
	(supports instrument18 infrared2)
	(supports instrument18 image4)
	(calibration_target instrument18 Star1)
	(supports instrument19 infrared3)
	(calibration_target instrument19 GroundStation4)
	(on_board instrument18 satellite9)
	(on_board instrument19 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Phenomenon20)
	(supports instrument20 infrared2)
	(calibration_target instrument20 Star1)
	(supports instrument21 thermograph1)
	(supports instrument21 image0)
	(calibration_target instrument21 Star1)
	(supports instrument22 thermograph1)
	(calibration_target instrument22 GroundStation0)
	(on_board instrument20 satellite10)
	(on_board instrument21 satellite10)
	(on_board instrument22 satellite10)
	(power_avail satellite10)
	(pointing satellite10 Star22)
	(supports instrument23 infrared2)
	(supports instrument23 image4)
	(supports instrument23 thermograph1)
	(calibration_target instrument23 Star3)
	(on_board instrument23 satellite11)
	(power_avail satellite11)
	(pointing satellite11 Star8)
)
(:goal (and
	(pointing satellite1 Star22)
	(pointing satellite4 Phenomenon20)
	(pointing satellite8 Planet16)
	(have_image Planet5 image0)
	(have_image Planet6 image4)
	(have_image Planet7 image4)
	(have_image Phenomenon9 image4)
	(have_image Star10 thermograph1)
	(have_image Planet11 image4)
	(have_image Planet12 thermograph1)
	(have_image Planet13 infrared3)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 infrared2)
	(have_image Planet16 infrared2)
	(have_image Phenomenon17 thermograph1)
	(have_image Star18 image4)
	(have_image Star21 thermograph1)
	(have_image Star22 image4)
	(have_image Phenomenon23 infrared3)
	(have_image Phenomenon24 infrared3)
))

)

; plan
1. (turn_to satellite1 star22 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star22)
   goals met: 1 of 20
2. (turn_to satellite4 phenomenon20 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 20
3. (turn_to satellite8 planet16 phenomenon23)
   deleted: (pointing satellite8 phenomenon23)
   added: (pointing satellite8 planet16)
   goals met: 3 of 20
4. (switch_on instrument23 satellite11)
   deleted: (power_avail satellite11)
   added: (power_on instrument23)
   goals met: 3 of 20
5. (turn_to satellite11 star3 star8)
   deleted: (pointing satellite11 star8)
   added: (pointing satellite11 star3)
   goals met: 3 of 20
6. (calibrate satellite11 instrument23 star3)
   added: (calibrated instrument23)
   goals met: 3 of 20
7. (turn_to satellite11 planet6 star3)
   deleted: (pointing satellite11 star3)
   added: (pointing satellite11 planet6)
   goals met: 3 of 20
8. (take_image satellite11 planet6 instrument23 image4)
   added: (have_image planet6 image4)
   goals met: 4 of 20
9. (turn_to satellite11 star10 planet6)
   deleted: (pointing satellite11 planet6)
   added: (pointing satellite11 star10)
   goals met: 4 of 20
10. (take_image satellite11 star10 instrument23 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 5 of 20
11. (turn_to satellite11 planet12 star10)
   deleted: (pointing satellite11 star10)
   added: (pointing satellite11 planet12)
   goals met: 5 of 20
12. (take_image satellite11 planet12 instrument23 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 20
13. (turn_to satellite11 phenomenon14 planet12)
   deleted: (pointing satellite11 planet12)
   added: (pointing satellite11 phenomenon14)
   goals met: 6 of 20
14. (take_image satellite11 phenomenon14 instrument23 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 7 of 20
15. (turn_to satellite11 phenomenon15 phenomenon14)
   deleted: (pointing satellite11 phenomenon14)
   added: (pointing satellite11 phenomenon15)
   goals met: 7 of 20
16. (take_image satellite11 phenomenon15 instrument23 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 8 of 20
17. (turn_to satellite11 planet16 phenomenon15)
   deleted: (pointing satellite11 phenomenon15)
   added: (pointing satellite11 planet16)
   goals met: 8 of 20
18. (take_image satellite11 planet16 instrument23 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 9 of 20
19. (turn_to satellite11 phenomenon17 planet16)
   deleted: (pointing satellite11 planet16)
   added: (pointing satellite11 phenomenon17)
   goals met: 9 of 20
20. (take_image satellite11 phenomenon17 instrument23 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 10 of 20
21. (turn_to satellite11 star21 phenomenon17)
   deleted: (pointing satellite11 phenomenon17)
   added: (pointing satellite11 star21)
   goals met: 10 of 20
22. (take_image satellite11 star21 instrument23 thermograph1)
   added: (have_image star21 thermograph1)
   goals met: 11 of 20
23. (turn_to satellite11 star22 star21)
   deleted: (pointing satellite11 star21)
   added: (pointing satellite11 star22)
   goals met: 11 of 20
24. (take_image satellite11 star22 instrument23 image4)
   added: (have_image star22 image4)
   goals met: 12 of 20
25. (turn_to satellite11 star18 star22)
   deleted: (pointing satellite11 star22)
   added: (pointing satellite11 star18)
   goals met: 12 of 20
26. (take_image satellite11 star18 instrument23 image4)
   added: (have_image star18 image4)
   goals met: 13 of 20
27. (turn_to satellite11 planet11 star18)
   deleted: (pointing satellite11 star18)
   added: (pointing satellite11 planet11)
   goals met: 13 of 20
28. (take_image satellite11 planet11 instrument23 image4)
   added: (have_image planet11 image4)
   goals met: 14 of 20
29. (turn_to satellite11 planet7 planet11)
   deleted: (pointing satellite11 planet11)
   added: (pointing satellite11 planet7)
   goals met: 14 of 20
30. (take_image satellite11 planet7 instrument23 image4)
   added: (have_image planet7 image4)
   goals met: 15 of 20
31. (turn_to satellite11 phenomenon9 planet7)
   deleted: (pointing satellite11 planet7)
   added: (pointing satellite11 phenomenon9)
   goals met: 15 of 20
32. (take_image satellite11 phenomenon9 instrument23 image4)
   added: (have_image phenomenon9 image4)
   goals met: 16 of 20
33. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 16 of 20
34. (turn_to satellite3 groundstation0 star21)
   deleted: (pointing satellite3 star21)
   added: (pointing satellite3 groundstation0)
   goals met: 16 of 20
35. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 16 of 20
36. (turn_to satellite3 planet5 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet5)
   goals met: 16 of 20
37. (take_image satellite3 planet5 instrument7 image0)
   added: (have_image planet5 image0)
   goals met: 17 of 20
38. (turn_to satellite3 phenomenon24 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon24)
   goals met: 17 of 20
39. (take_image satellite3 phenomenon24 instrument7 infrared3)
   added: (have_image phenomenon24 infrared3)
   goals met: 18 of 20
40. (turn_to satellite3 planet13 phenomenon24)
   deleted: (pointing satellite3 phenomenon24)
   added: (pointing satellite3 planet13)
   goals met: 18 of 20
41. (take_image satellite3 planet13 instrument7 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 19 of 20
42. (turn_to satellite3 phenomenon23 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 phenomenon23)
   goals met: 19 of 20
43. (take_image satellite3 phenomenon23 instrument7 infrared3)
   added: (have_image phenomenon23 infrared3)
   goals met: 20 of 20
